/**
 * Написать метод, которому на вход подается некоторая строка (пароль).
 * Метод должен проверить данную строку на соответствие следующим условиям:
 * 1. В строке должно быть не менее 8 символов;
 * 2. В строке должны быть только цыфры и латинские буквы;
 * 3. Буквы должны быть как в верхнем так и в нижнем регистре;
 * Метод возвращает boolean значение
 * Задачу необходимо решить используя регулярные выражения
 */

package lesson_3_Collections_and_Regular_expressions.regularExpressionsTask;

public class RegularExpressionsTask {

}
